In [9]:
import pandas as pd

Data Analysis
1. description
2. diagnosis
3. prediction 
4. action

In [17]:
# the column names
cols = ['user_id','movie_id','rating','ts']

In [18]:
# read the file
df=pd.read_csv('u.data', sep='\t',names=cols)

In [55]:
a=[4,8,7,2,9]

In [61]:
# b = [8,16,4,14,18]

b = []
for i in a:
    b.append(i*2)
b

[8, 16, 14, 4, 18]

In [62]:
item_cols = ['movie_id','title'] + [str(i) for i in range(22)]

In [67]:
# read other file
df1= pd.read_csv('u.item', sep='|', names = item_cols,
                 encoding = "ISO-8859-1") [['movie_id','title']]

In [68]:
df1.shape

(1682, 2)







exploratory data analysis

In [71]:
df.sample(5)

       user_id  movie_id  rating         ts
6370        62      1136       3  879375977
21945      292         7       3  881104068
78409      481       181       5  885827974
50692       80       237       4  887401732
23190       76       324       4  875027206

In [69]:
df1.sample(5)

      movie_id                         title
763        764           If Lucy Fell (1996)
398        399  Three Musketeers, The (1993)
1662      1663       Nothing Personal (1995)
1133      1134         Get on the Bus (1996)
220        221     Breaking the Waves (1996)

In [70]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100003 entries, 0 to 100002
Data columns (total 4 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   user_id   100003 non-null  int64
 1   movie_id  100003 non-null  int64
 2   rating    100003 non-null  int64
 3   ts        100003 non-null  int64
dtypes: int64(4)
memory usage: 3.1 MB

In [44]:
df.describe(include='all')

             user_id       movie_id         rating            ts
count  100003.000000  100003.000000  100003.000000  1.000030e+05
mean      462.470876     425.520914       3.529864  8.835288e+08
std       266.622454     330.797791       1.125704  5.343791e+06
min         0.000000       1.000000       1.000000  8.747247e+08
25%       254.000000     175.000000       3.000000  8.794487e+08
50%       447.000000     322.000000       4.000000  8.828269e+08
75%       682.000000     631.000000       4.000000  8.882600e+08
max       943.000000    1682.000000       5.000000  8.932866e+08

try to find the diff. data 
1 strings with categoical info
2 strings with random stuff
3 numbers with quantified info
4 number with categorial info
5 random no. or id start of data

In [45]:
df.columns

Index(['user_id', 'movie_id', 'rating', 'ts'], dtype='object')

In [46]:
df['rating'].unique()

array([5, 1, 3, 2, 4], dtype=int64)

In [47]:
df['rating'].nunique()

5

In [48]:
df['user_id'].unique()

array([  0, 196, 186,  22, 244, 166, 298, 115, 253, 305,   6,  62, 286,
       200, 210, 224, 303, 122, 194, 291, 234, 119, 167, 299, 308,  95,
        38, 102,  63, 160,  50, 301, 225, 290,  97, 157, 181, 278, 276,
         7,  10, 284, 201, 287, 246, 242, 249,  99, 178, 251,  81, 260,
        25,  59,  72,  87,  42, 292,  20,  13, 138,  60,  57, 223, 189,
       243,  92, 241, 254, 293, 127, 222, 267,  11,   8, 162, 279, 145,
        28, 135,  32,  90, 216, 250, 271, 265, 198, 168, 110,  58, 237,
        94, 128,  44, 264,  41,  82, 262, 174,  43,  84, 269, 259,  85,
       213, 121,  49, 155,  68, 172,  19, 268,   5,  80,  66,  18,  26,
       130, 256,   1,  56,  15, 207, 232,  52, 161, 148, 125,  83, 272,
       151,  54,  16,  91, 294, 229,  36,  70,  14, 295, 233, 214, 192,
       100, 307, 297, 193, 113, 275, 219, 218, 123, 158, 302,  23, 296,
        33, 154,  77, 270, 187, 170, 101, 184, 112, 133, 215,  69, 104,
       240, 144, 191,  61, 142, 177, 203,  21, 197, 134, 180, 236, 263,
       109,  64, 114, 239, 117,  65, 137, 257, 111, 285,  96, 116,  73,
       221, 235, 164, 281, 182, 129,  45, 131, 230, 126, 231, 280, 288,
       152, 217,  79,  75, 245, 282,  78, 118, 283, 171, 107, 226, 306,
       173, 185, 150, 274, 188,  48, 311, 165, 208,   2, 205, 248,  93,
       159, 146,  29, 156,  37, 141, 195, 108,  47, 255,  89, 140, 190,
        24,  17, 313,  53, 124, 149, 176, 106, 312, 175, 153, 220, 143,
       199, 202, 277, 206,  76, 314, 136, 179,   4, 304,   3, 227, 252,
       212, 310,  35, 147, 105,  34,  71,  51, 204, 315,  31, 316, 103,
       318,  30, 120,  46, 289, 209, 261,  88,   9, 247, 321, 266,  74,
       238, 319, 323,  67, 211,  98,  12,  40, 258, 228, 325, 320, 326,
       327, 183, 328, 322, 330,  27, 331, 332, 329,  86, 139, 300, 163,
       333, 334,  39, 324, 132, 336, 335, 169, 338, 339, 309, 342, 340,
       317, 341, 343, 344, 345, 346, 347, 273,  55, 349, 348, 354, 351,
       358, 352, 360, 363, 355, 362, 357, 356, 361, 365, 350, 367, 368,
       371, 373, 370, 374, 372, 337, 378, 366, 377, 375, 359, 379, 380,
       381, 385, 382, 387, 364, 369, 388, 386, 389, 383, 390, 393, 392,
       376, 394, 391, 398, 397, 399, 396, 401, 402, 384, 395, 353, 403,
       405, 400, 406, 407, 409, 404, 413, 416, 408, 410, 411, 417, 412,
       420, 422, 425, 419, 415, 423, 429, 428, 427, 418, 424, 432, 421,
       435, 433, 426, 436, 430, 434, 437, 438, 431, 442, 440, 445, 447,
       449, 450, 446, 439, 451, 452, 454, 453, 414, 455, 444, 448, 457,
       456, 458, 462, 459, 460, 461, 467, 468, 466, 472, 465, 463, 471,
       474, 469, 464, 476, 478, 473, 470, 480, 441, 479, 484, 486, 487,
       482, 481, 492, 493, 490, 489, 483, 496, 494, 495, 477, 497, 488,
       498, 499, 491, 500, 502, 503, 504, 505, 506, 443, 507, 514, 508,
       511, 515, 512, 513, 475, 523, 518, 509, 516, 510, 524, 501, 525,
       521, 520, 519, 528, 532, 530, 531, 529, 517, 527, 485, 533, 535,
       536, 526, 537, 534, 541, 538, 542, 545, 539, 547, 543, 548, 546,
       522, 551, 544, 553, 552, 540, 554, 550, 556, 559, 560, 561, 563,
       566, 557, 558, 564, 565, 573, 549, 567, 569, 562, 576, 577, 579,
       574, 555, 572, 575, 584, 588, 587, 568, 586, 585, 582, 591, 581,
       592, 580, 590, 593, 583, 596, 570, 599, 589, 594, 597, 578, 601,
       602, 600, 605, 603, 595, 606, 608, 607, 610, 611, 617, 618, 614,
       609, 615, 616, 620, 571, 619, 613, 622, 621, 604, 624, 612, 627,
       623, 628, 625, 629, 633, 632, 631, 634, 639, 630, 642, 637, 640,
       626, 643, 598, 638, 635, 644, 636, 645, 648, 647, 650, 651, 654,
       653, 655, 649, 658, 656, 660, 659, 646, 663, 664, 657, 665, 666,
       661, 662, 667, 641, 668, 673, 671, 669, 676, 674, 652, 677, 682,
       679, 684, 685, 683, 691, 672, 692, 690, 689, 686, 693, 688, 697,
       698, 670, 694, 680, 705, 701, 699, 704, 707, 700, 687, 695, 675,
       708, 709, 711, 710, 712, 715, 713, 716, 681, 678, 719, 702, 721,
       714, 717, 718, 696, 722, 724, 727, 725, 706, 720, 729, 726, 728,
       703, 738, 736, 734, 730, 743, 742, 737, 733, 745, 740, 735, 747,
       723, 739, 749, 748, 746, 731, 750, 741, 751, 756, 757, 752, 758,
       732, 762, 744, 754, 753, 763, 764, 767, 769, 755, 771, 768, 773,
       765, 772, 766, 774, 760, 761, 777, 759, 776, 780, 779, 778, 782,
       786, 784, 770, 788, 789, 790, 787, 783, 785, 794, 781, 796, 795,
       793, 798, 791, 802, 800, 804, 803, 775, 792, 799, 805, 806, 807,
       797, 801, 809, 815, 817, 821, 818, 814, 812, 823, 825, 827, 829,
       811, 830, 826, 831, 819, 828, 808, 835, 833, 836, 816, 838, 839,
       840, 832, 810, 844, 843, 834, 846, 837, 813, 842, 847, 848, 822,
       852, 851, 849, 854, 850, 858, 853, 855, 824, 845, 841, 859, 862,
       856, 820, 863, 860, 857, 864, 865, 868, 867, 861, 870, 871, 875,
       876, 872, 866, 877, 873, 880, 878, 869, 881, 879, 883, 882, 884,
       886, 885, 889, 874, 892, 890, 893, 887, 891, 894, 896, 897, 901,
       899, 903, 904, 907, 905, 902, 898, 895, 906, 900, 908, 916, 911,
       912, 914, 918, 919, 921, 910, 913, 915, 922, 923, 928, 927, 924,
       929, 931, 917, 932, 909, 934, 933, 935, 938, 940, 888, 925, 942,
       937, 926, 943, 939, 936, 930, 920, 941], dtype=int64)

In [49]:
df['user_id'].nunique()

944


# merging the data fames

In [73]:
movie = pd.merge(df,df1, on ='movie_id')
movie.head()

   user_id  movie_id  rating         ts             title
0        0        50       5  881250949  Star Wars (1977)
1      290        50       5  880473582  Star Wars (1977)
2       79        50       4  891271545  Star Wars (1977)
3        2        50       5  888552084  Star Wars (1977)
4        8        50       5  879362124  Star Wars (1977)

In [75]:
# remove the redundant or useless column i.e ts
movie.drop('ts', axis=1, inplace=True)

In [76]:
movie.head()

   user_id  movie_id  rating             title
0        0        50       5  Star Wars (1977)
1      290        50       5  Star Wars (1977)
2       79        50       4  Star Wars (1977)
3        2        50       5  Star Wars (1977)
4        8        50       5  Star Wars (1977)

In [77]:
movie.columns

Index(['user_id', 'movie_id', 'rating', 'title'], dtype='object')

In [82]:
# find the no. of ratings for each movie
movie['title'].value_counts().head(10)

Star Wars (1977)                 584
Contact (1997)                   509
Fargo (1996)                     508
Return of the Jedi (1983)        507
Liar Liar (1997)                 485
English Patient, The (1996)      481
Scream (1996)                    478
Toy Story (1995)                 452
Air Force One (1997)             431
Independence Day (ID4) (1996)    429
Name: title, dtype: int64

In [83]:
# find the average rating for each movie
movie.groupby('title')['rating'].mean().sort_values(ascending=False).head(10)

title
They Made Me a Criminal (1939)                       5.0
Marlene Dietrich: Shadow and Light (1996)            5.0
Saint of Fort Washington, The (1993)                 5.0
Someone Else's America (1995)                        5.0
Star Kid (1997)                                      5.0
Great Day in Harlem, A (1994)                        5.0
Aiqing wansui (1994)                                 5.0
Santa with Muscles (1996)                            5.0
Prefontaine (1997)                                   5.0
Entertaining Angels: The Dorothy Day Story (1996)    5.0
Name: rating, dtype: float64